In [2]:
import numpy as np
import pandas as pd
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

In [3]:
labels = ['First','Second', 'Third']                 # string list
values = [10,31,10]                                  # numeric list
array = np.arange(10,31,10)                         # numpy array
dico = {'First':10,'Second':20,'Third':30}           # Python dictionary

# create various series
A = pd.Series(values)
print('Default values')
A                                                    # show

B = pd.Series(values,labels)
print('\nPrint numeric list and label') 
B                                                    # show

C = pd.Series(array,labels)
print('\nUsing python arrays and labels')
C                                                    # show

D = pd.Series(dico)
print('\n Passing a dictionary')
D                                                    # show

Default values

0    10
1    31
2    10
dtype: int64

Print numeric list and label

First     10
Second    31
Third     10
dtype: int64

Using python arrays and labels

First     10
Second    20
Third     30
dtype: int64

 Passing a dictionary

First     10
Second    20
Third     30
dtype: int64

In [4]:
pd.Series(labels, values)

10     First
31    Second
10     Third
dtype: object

In [5]:
# Series of WWII countries

pool1 = pd.Series([1,2,3,4],['USA','Britain','France','Germany'])
pool1                                                             # show
print('grabbing the first element')
pool1['USA']

USA        1
Britain    2
France     3
Germany    4
dtype: int64

grabbing the first element

1

In [6]:
pool2 = pd.Series(['USA','Britain', 'France','Germany'],[1,2,3,4])
pool2                                                              # show
print('grabbing the first element')
pool2[1]

1        USA
2    Britain
3     France
4    Germany
dtype: object

grabbing the first element

'USA'

In [7]:
pool3 = pd.Series([1,5,3,4],['USA', 'USSR','France','Germany'])
pool3

USA        1
USSR       5
France     3
Germany    4
dtype: int64

In [8]:
# Denonstrating series addition

double_pool = pool1 + pool1
print('Double Pool')
double_pool

mixed_pool = pool1 + pool3
print('\nMixed Pool')
mixed_pool

funny_pool = pool1 + pool2
print('\nFunny Pool')
funny_pool

Double Pool

USA        2
Britain    4
France     6
Germany    8
dtype: int64

Mixed Pool

Britain    NaN
France     6.0
Germany    8.0
USA        2.0
USSR       NaN
dtype: float64

Funny Pool

1          NaN
2          NaN
3          NaN
4          NaN
Britain    NaN
France     NaN
Germany    NaN
USA        NaN
dtype: object

In [9]:
df = pd.DataFrame([pool1])  # passing a series
df                          # show

# two series
index = 'WWI WWII'.split()
new_df = pd.DataFrame([pool1,pool3],index)
new_df                      # show

   USA  Britain  France  Germany
0    1        2       3        4

      USA  Britain  France  Germany  USSR
WWI   1.0      2.0     3.0      4.0   NaN
WWII  1.0      NaN     3.0      4.0   5.0

In [10]:
# Illustrating the split() method

email = 'pythonguy@gmail.com'
string_vec = email.split('@')
string_vec                            # show
A = string_vec[0]; B = string_vec[1]  # Extracting values 
print('Username:',A,'\nDomain name:',B)

['pythonguy', 'gmail.com']

Username: pythonguy
Domain name: gmail.com

In [11]:
# Create dataframe with an array

Array = np.arange(1,21).reshape(5,4) # numpy array
row_labels = 'A B C D E'.split()
col_labels = 'odd1 even1 odd2 even2'.split()
Arr_df = pd.DataFrame(Array,row_labels,col_labels)
Arr_df

   odd1  even1  odd2  even2
A     1      2     3      4
B     5      6     7      8
C     9     10    11     12
D    13     14    15     16
E    17     18    19     20

In [12]:
# Exercise

In [13]:
random_array = np.random.randn(20).reshape(5,4)
random_array
row_names = 'Row-1 Row-2 Row-3 Row-4 Row-5'.split()
col_names = 'Column-1,Column-2,Column-3,Column-4'.split(',')
my_df = pd.DataFrame(random_array,row_names,col_names)
my_df

array([[-1.15125443,  0.66050122,  1.01715444, -1.1518819 ],
       [ 0.07379146, -0.52524698,  1.22576774,  2.33405602],
       [-1.30649245,  0.94594848, -0.66786871,  1.38659924],
       [-0.28610799, -0.46468194, -0.92983412, -1.71468165],
       [-0.82088732, -0.18991151, -0.16565957,  1.99436313]])

       Column-1  Column-2  Column-3  Column-4
Row-1 -1.151254  0.660501  1.017154 -1.151882
Row-2  0.073791 -0.525247  1.225768  2.334056
Row-3 -1.306492  0.945948 -0.667869  1.386599
Row-4 -0.286108 -0.464682 -0.929834 -1.714682
Row-5 -0.820887 -0.189912 -0.165660  1.994363

In [14]:
# Grab data frame elements

In [15]:
Arr_df['odd1']                             # grabbing first column

A     1
B     5
C     9
D    13
E    17
Name: odd1, dtype: int64

In [16]:
# Grab two columns
Arr_df[['odd1','even2']] # grabbing first and last columns

   odd1  even2
A     1      4
B     5      8
C     9     12
D    13     16
E    17     20

In [17]:
Arr_df['odd2']['D']
Arr_df['odd2']['E']
Arr_df['even2']['A']

15

19

4

In [18]:
x = Arr_df['odd2']
x

A     3
B     7
C    11
D    15
E    19
Name: odd2, dtype: int64

In [19]:
x['D']

15

In [20]:
# grabbing rows

In [25]:
print("using .loc['E']")
Arr_df.loc['E']
print('\nusing.iloc[4]')
Arr_df.iloc[4]

using .loc['E']

odd1        17
even1       18
odd2        19
even2       20
Odd sum     36
Even sum    38
Name: E, dtype: int64

using.iloc[4]

odd1        17
even1       18
odd2        19
even2       20
Odd sum     36
Even sum    38
Name: E, dtype: int64

In [26]:
Arr_df.loc['E']['even2']
Arr_df.iloc[4]['even2']

20

20

In [27]:
# Let us add two columns to Arr_df
Arr_df['Odd sum'] = Arr_df['odd1'] + Arr_df['odd2']
Arr_df['Even sum'] = Arr_df['even1'] + Arr_df['even2']
Arr_df

   odd1  even1  odd2  even2  Odd sum  Even sum
A     1      2     3      4        4         6
B     5      6     7      8       12        14
C     9     10    11     12       20        22
D    13     14    15     16       28        30
E    17     18    19     20       36        38

In [28]:
# Exercise

In [47]:
Arr_df['Total sum'] = Arr_df['Odd sum'] + Arr_df['Even sum']
Arr_df

   odd1  even1  odd2  even2  Odd sum  Even sum  Total sum
A     1      2     3      4        4         6         10
B     5      6     7      8       12        14         26
C     9     10    11     12       20        22         42
D    13     14    15     16       28        30         58
E    17     18    19     20       36        38         74

In [30]:
Arr_df['disposable'] = np.zeros(5) # new column
Arr_df                            # show

   odd1  even1  odd2  even2  Odd sum  Even sum  Total sum  disposable
A     1      2     3      4        4         6         10         0.0
B     5      6     7      8       12        14         26         0.0
C     9     10    11     12       20        22         42         0.0
D    13     14    15     16       28        30         58         0.0
E    17     18    19     20       36        38         74         0.0

In [31]:
# to remove
Arr_df.drop('disposable',axis=1,inplace=True)
Arr_df

   odd1  even1  odd2  even2  Odd sum  Even sum  Total sum
A     1      2     3      4        4         6         10
B     5      6     7      8       12        14         26
C     9     10    11     12       20        22         42
D    13     14    15     16       28        30         58
E    17     18    19     20       36        38         74

In [32]:
# Conditional selection

In [33]:
# Grab elements greater than five
Arr_df[Arr_df > 5]

   odd1  even1  odd2  even2  Odd sum  Even sum  Total sum
A   NaN    NaN   NaN    NaN      NaN         6         10
B   NaN    6.0   7.0    8.0     12.0        14         26
C   9.0   10.0  11.0   12.0     20.0        22         42
D  13.0   14.0  15.0   16.0     28.0        30         58
E  17.0   18.0  19.0   20.0     36.0        38         74

In [ ]:
# Grab elements less than 5

In [52]:
Arr_df[Arr_df < 5]

   odd1  even1  odd2  even2  Odd sum  Even sum  Total sum
A   1.0    2.0   3.0    4.0      4.0       NaN        NaN
B   NaN    NaN   NaN    NaN      NaN       NaN        NaN
C   NaN    NaN   NaN    NaN      NaN       NaN        NaN
D   NaN    NaN   NaN    NaN      NaN       NaN        NaN
E   NaN    NaN   NaN    NaN      NaN       NaN        NaN

In [34]:
# removing row C through the first column
Arr_df[Arr_df['odd1'] != 9]

   odd1  even1  odd2  even2  Odd sum  Even sum  Total sum
A     1      2     3      4        4         6         10
B     5      6     7      8       12        14         26
D    13     14    15     16       28        30         58
E    17     18    19     20       36        38         74

# does the same thing: remove row 'C'
Arr_df[Arr_df['even2'] != 12]

In [36]:
# Let us remove rows D and E through 'even2'
Arr_df[Arr_df['even2'] <= 12]

   odd1  even1  odd2  even2  Odd sum  Even sum  Total sum
A     1      2     3      4        4         6         10
B     5      6     7      8       12        14         26
C     9     10    11     12       20        22         42

In [37]:
# Exercise

In [39]:
# Removing C,D,E via 'Even Sum'

In [38]:
Arr_df[Arr_df['Even sum'] <=14 ]

   odd1  even1  odd2  even2  Odd sum  Even sum  Total sum
A     1      2     3      4        4         6         10
B     5      6     7      8       12        14         26

In [40]:
# Removing A, B via 'Total sum'

In [41]:
Arr_df[Arr_df['Total sum'] > 26]

   odd1  even1  odd2  even2  Odd sum  Even sum  Total sum
C     9     10    11     12       20        22         42
D    13     14    15     16       28        30         58
E    17     18    19     20       36        38         74

In [ ]:
# Removing E via odd2

In [42]:
Arr_df[Arr_df['odd2'] <= 15]

   odd1  even1  odd2  even2  Odd sum  Even sum  Total sum
A     1      2     3      4        4         6         10
B     5      6     7      8       12        14         26
C     9     10    11     12       20        22         42
D    13     14    15     16       28        30         58

In [51]:
Arr_df[(Arr_df['odd1'] > 1) & (Arr_df['Even sum'] < 22)]

   odd1  even1  odd2  even2  Odd sum  Even sum  Total sum
B     5      6     7      8       12        14         26